Autodesk.Revit.UI.SelectionUIOptions.ElementSelectsAsPinned(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element)
Checks whether the specified element will be treated as pinned for the purposes of selection.
Remarks:
To improve usability, the option to disable pinned selection has some additional intelligence
beyond simply checking the pinned status.  For example, if a model group is pinned, the corresponding
attached detail group will also be treated as pinned for the purposes of selection.  If this method
returns true, the specified element will not be selectable when selection of pinned elements is
disabled.
document:
The document containing the element.
element:
The element to check.
Returns:
True if the specified element should be treated as pinned for selection purposes, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.SelectionUIOptions.GetSelectionUIOptions
Returns the current user's SelectionOptions.
Returns:
The SelectionOptions for the current user.
Since:
2016

Autodesk.Revit.UI.SelectionUIOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.SelectionUIOptions.ActivateControlsAndDimensionsOnMultiSelect
Indicates whether controls and temporary dimensions are activated on selection of multiple elements.
Remarks:
Revit always shows certain controls and temporary dimensions for a single selected element
When this option is set Revit also shows these controls and dimensions when multiple elements are selected.
Note that this setting takes effect on the next selection change.
To have this change take effect immediately use Selection.SetElementIds(Selection.GetElementIds());
Since:
2016

Autodesk.Revit.UI.SelectionUIOptions.SelectPinned
Indicates whether pinned elements can be selected.
Remarks:
When this setting is false, the user cannot select most pinned elements in canvas.  This option
helps users avoid accidentally moving important pinned objects such as levels and grids.  When
this option is true, the user can select pinned elements directly.
Note that to improve usability, the behavior of this option has some added intelligence
beyond simply checking whether the element is pinned.  For example, if a model group is pinned,
the corresponding attached detail group is not selectable if selection of pinned elements is
disabled.  To check whether a particular element is pinned for purposes of this setting, see
Autodesk.Revit.UI.SelectionUIOptions.ElementSelectsAsPinned(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element).
Since:
2016

Autodesk.Revit.UI.SelectionUIOptions.DragOnSelection
Indicates whether elements can be dragged immediately when they are selected.
Remarks:
When this setting is false, the user must click once to select an element and then must
explicitly click again in order to drag the element.  This option helps users avoid accidentally
moving elements.  When this setting is true, the user can click on an element to select it
and drag the element immediately by holding down the mouse.
Since:
2016

Autodesk.Revit.UI.SelectionUIOptions.SelectUnderlay
Indicates whether elements that are displayed as underlay can be selected.
Remarks:
When this setting is false, if an element is displayed as underlay in a view then the user will
not be able to select it in that view.  The element may still be selected in views where it
is not displayed as underlay.  When this setting is true, elements that are displayed as underlay
may still be selected.
Since:
2016

Autodesk.Revit.UI.SelectionUIOptions.SelectLinks
Indicates whether Revit and CAD link instances can be selected.
Remarks:
When this setting is false, users cannot directly select link instances or elements within them in the
canvas.  This makes it easy for the user to avoid accidentally selecting and moving
links.  When this setting is true, users can select link instances.
Since:
2016

Autodesk.Revit.UI.SelectionUIOptions.SelectFaces
Indicates whether elements can be selected by clicking on the interior of a face.
Remarks:
When this setting is false, users must click on an edge or vertex of an element
in order to select the corresponding element.  When it is true, users may also select elements by clicking
on the interior of a face of an element.
Since:
2016

Autodesk.Revit.UI.SelectionUIOptions
Provides access to user settings related to how selection will behave in Revit's UI.
Remarks:
The settings in this class define how selection will behave when the user is
selecting one or more elements in a graphical view.  These settings do not affect programmatic selection behavior.
Some UI commands may override the user's settings while the command is active.
These settings are per user and will affect the selection behavior in all
projects and families.  The settings are not stored in the project.
Since:
2016